conf/src/DataProcessors/ЭП_ЗаполнениеУчетаВремени/ЭП_ЗаполнениеУчетаВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЭП_ЗаполнениеУчетаВремени</name>
</mdclass:DataProcessor>

conf/src/InformationRegisters/ЭП_ЭффективностьСотрудников/ЭП_ЭффективностьСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЭП_ЭффективностьСотрудников</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ПериодОценивания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПрофильРасчета</name>
    <type>
      <types>CatalogRef.ЭП_ПрофилиРасчетаРезультативности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ЭП_Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/AccumulationRegisters/УчетВремени/УчетВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетВремени</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>УДАЛИТЬЭтап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Этап</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТехническийПроект</name>
    <type>
      <types>CatalogRef.ТехническиеПроекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ошибка</name>
    <type>
      <types>CatalogRef.Ошибки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Задача</name>
    <type>
      <types>CatalogRef.ЗадачиПроцесса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>350</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

conf/src/Catalogs/ЭП_ПрофилиРасчетаРезультативности/ЭП_ПрофилиРасчетаРезультативности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ПрофилиРасчетаРезультативности</name>
  <owners>Catalog.ЭП_ГруппыРасчетныхПрофилей</owners>
  <attributes>
    <name>Департамент</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальныйПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйПорог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельности</name>
    <type>
      <types>CatalogRef.ВидыДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>ТехническаяПоддержка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесовойКоэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦелевоеЗначение</name>
      <type>
        <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособАгрегации</name>
      <type>
        <types>EnumRef.ЭП_СпособыАгрегации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>Characteristic.ЭП_ПоказателиЭффективностиСотрудников</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/DataProcessors/ЭП_ЗаполнениеУчетаВремени/Forms/Форма/Module.bsl
&НаКлиенте
Процедура СгенерироватьЗаписи(Команда)
	СгенерироватьЗаписиНаСервере();
КонецПроцедуры

&НаСервере
Процедура СгенерироватьЗаписиНаСервере()
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЭП_ЭффективностьСотрудников.Сотрудник КАК Сотрудник,
	               |	ЭП_ЭффективностьСотрудников.Значение КАК Значение
	               |ПОМЕСТИТЬ ВТ_ТекущиеЗначения
	               |ИЗ
	               |	РегистрСведений.ЭП_ЭффективностьСотрудников КАК ЭП_ЭффективностьСотрудников
	               |ГДЕ
	               |	ЭП_ЭффективностьСотрудников.ПериодОценивания = &ПериодОценивания
	               |	И ЭП_ЭффективностьСотрудников.Показатель = &Показатель
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Сотрудник
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	&ПериодОценивания КАК ПериодОценивания,
	               |	&Ответственный КАК Ответственный,
	               |	УчетВремениОбороты.Проект КАК Проект,
	               |	УчетВремениОбороты.Пользователь.ЭП_Сотрудник КАК Сотрудник,
	               |	ЭП_ПрофилиРасчетаРезультативности.Ссылка КАК ПрофильРасчета,
	               |	&Показатель КАК Показатель,
	               |	УчетВремениОбороты.ДлительностьОборот / 3600 КАК Значение
	               |ИЗ
	               |	РегистрНакопления.УчетВремени.Обороты(НАЧАЛОПЕРИОДА(&ПериодОценивания, МЕСЯЦ), ДОБАВИТЬКДАТЕ(КОНЕЦПЕРИОДА(&ПериодОценивания, МЕСЯЦ), ДЕНЬ, 5), , ) КАК УчетВремениОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ЭП_ПрофилиРасчетаРезультативности КАК ЭП_ПрофилиРасчетаРезультативности
	               |		ПО УчетВремениОбороты.ВидДеятельности = ЭП_ПрофилиРасчетаРезультативности.ВидДеятельности
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеЗначения КАК ВТ_ТекущиеЗначения
	               |		ПО УчетВремениОбороты.Пользователь.ЭП_Сотрудник = ВТ_ТекущиеЗначения.Сотрудник
	               |			И (НЕ УчетВремениОбороты.ДлительностьОборот = ВТ_ТекущиеЗначения.Значение)
	               |ГДЕ
	               |	УчетВремениОбороты.Пользователь.ЭП_ГенерацияЗаписейВремени
	               |	И ВТ_ТекущиеЗначения.Сотрудник ЕСТЬ NULL"; 
	Запрос.УстановитьПараметр("ПериодОценивания",НачалоМесяца(ПериодОценивания));
	Запрос.УстановитьПараметр("Ответственный", ТекущийПользователь);
	Запрос.УстановитьПараметр("Показатель", Показатель); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "За выбранный период не найдено внесенных часов.";        
		Сообщение.Сообщить();
		Возврат;		
	
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборДанных = РегистрыСведений.ЭП_ЭффективностьСотрудников.СоздатьМенеджерЗаписи();
	
	Пока Выборка.Следующий() Цикл
		
		ЗаполнитьЗначенияСвойств(НаборДанных, Выборка); 
		НаборДанных.Комментарий = "Запись созданна автоматической обработкой.";
		НаборДанных.Записать();
	
	КонецЦикла;
	
КонецПроцедуры
